extends MarginContainer

@export var gen_but : Button
func _ready() -> void:
	gen_but.pressed.connect(gen_new_name)

var rnd = RandomNumberGenerator.new()

var f_name_0 = ["Рен","Юдзи","Кен","Таку","Иори","Хироки","Кота","Наоки","Ясуо","Кенжи"]
var s_name_0 = ["Танаками","Харакава","Шимадзу","Ичикава","Курата","Сугивара","Саваяма",
"Касунага","Мизухара","Хасэгава","Леруа","Дюфрен","Дюран","Лабуа","Де Монье","Дюбуа","Лаферр"
,"Ребуа","Бертон","Ле Гран"]

var f_name_1 = ["Анри","Реми","Морис","Пьер","Жак","Луи","Этьен","Ален","Жюльен","Виктор"]
var s_name_1 = ["Леруа","Дюфрен","Дюран","Лабуа","Де Монье","Дюбуа","Лаферр","Ребуа","Бертон","Ле Гран"]

var nickname = ["Икарн","Карлик","Медный Ворон","Паровой Лис","Тихий Молот","Серый Странник","Пепельный Клинок",
"Смотрящий в Туман","Железный Карп","Ночной Курьер","Мастер Искр","Старый Котёл","Чернильный Барон",
"Стальной Страж","Фонарщик","Пыльный Маршал","Хранитель Рельс","Медный Священник","Проклятый Инженер",
"Человек из Дыма"]

func gen_new_name() -> void:
	var f_p = nickname[rnd.randi_range(0,nickname.size()-1)]
	if rnd.randi_range(0,1) == 1:
		print(f_name_0[rnd.randi_range(0,f_name_0.size()-1)]," ",s_name_0[rnd.randi_range(0,s_name_0.size()-1)]," ",f_p)
		
	else:
		print(f_name_1[rnd.randi_range(0,f_name_1.size()-1)]," ",s_name_1[rnd.randi_range(0,s_name_1.size()-1)]," ",f_p)
